<template>
  <section class="index-content">
    <div class="container">
      <div class="roow">
        <div class="cool-toolbar"><toolbar></toolbar></div>
        <div class="cool-content">
          <my-header></my-header>
          <section class="faq-content">
            <div class="faq-content__header">
              <div class="faq-content__header__title">
                <span>سوالات متداول</span>
              </div>
              <div class="faq-content__header__background">
                <img src="@/assets/img/Rectangle-9.png" alt="" />
              </div>
            </div>
            <div class="faq-content__wrapper">
              <ul>
                <faq-li
                  class="inview"
                  v-for="(item, i) in items"
                  :key="i"
                  :isActive="activeId == i"
                  :text="item.text"
                  :topic="item.topic"
                  @click="onClickQuestionBox(i)"
                ></faq-li>
              </ul>
            </div>
            <div class="faq-content__extra">
              <router-link to="contact-us">
                <p>
                  در صورتی که جواب سوال خود را پیدا نکرده اید برای مکالمه آنلاین با
                  پشتیبانان ما تماس بگیرید!
                </p>
              </router-link>
            </div>
          </section>
        </div>
      </div>
    </div>
  </section>
  <application></application>
  <my-footer></my-footer>
</template>

<script>
import Toolbar from "../components/Toolbar/toolbar.vue";
import MyFooter from "../components/Footer/MyFooter.vue";
import MyHeader from "../components/Header/MyHeader.vue";
import Application from "../components/Home/application.vue";
import FaqLi from "../components/Faq/faq-li.vue";

export default {
  name: "Faq",
  methods: {
    onClickQuestionBox(id) {
      if (this.activeId == id) {
        this.activeId = undefined;
        return;
      }
      this.activeId = id;
    },
  },
  components: { Toolbar, MyFooter, MyHeader, Application, FaqLi },
  data() {
    return {
      activeId: undefined,
      items: [
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
                {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
                {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
        {
          topic: "استفاده از محصولات برای چه اشخاصی توصیه می شود؟",
          text:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان" +
            "گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و" +
            "برای شرایط فعلی تکنولوژی مورد نیاز و متون بلکه روزنامه و مجله در ستون و" +
            "سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با",
        },
      ],
    };
  },
};
</script>
