<template>
  <section class="contact-us">
    <div class="container">
      <div class="roow">
        <div class="cool-toolbar"><toolbar></toolbar></div>
        <div class="cool-content">
          <my-header></my-header>
          <section class="terms-content">
            <div class="terms-content__head">
              <div class="terms-content__head__img">
                <img src="@/assets/img/Rectangle-7.png" alt="" />
              </div>

              <div class="terms-content__head__text">
                <h3>قوانین و مقررات</h3>
              </div>
            </div>

            <div class="terms-content__content">
              <p class="yellow">
                ثبت نام در سایت و اقدام به خرید و فروش در فروشگاه ووجی شاپ به معنای آگاهی
                کامل مشتری از قوانین وبسایت (این قرارداد) و به منزله‌ی پذیرش این قوانین و
                مقررات توسط مشتری است.
              </p>

              <p>
                توضیحاتی در رابطه با عناوین استفاده شده در متن “قوانین و مقررات” فروشگاه
                “ووجی شاپ”:
              </p>

              <ul>
                <li>
                  – فروشگاه: فروشگاه اشاره به تمام فعایت هایی است که زیرمجموعه دامنه (ووجی
                  شاپ) به آدرس <span>wowgshop.com</span> صورت می پذیرد.
                </li>
                <li>
                  – مشتری: هر شخصیت حقیقی و حقوقی است که در فروشگاه اقدام به ایجاد حساب
                  کاربری نموده و از خدمات و محصولات فروشگاه استفاده می نماید.
                </li>
                <li>
                  – حساب کاربری: حسابی که مشتری جهت انجام سفارش خرید و فروش در فروشگاه
                  ایجاد می کند.
                </li>
                <li>
                  – سفارش: هر نوع درخواست خرید و فروش کالا یا خدمات که مشتری در فروشگاه
                  ثبت می نماید.
                </li>
                <li>
                  – کالا و خدمات: هر نوع کالا یا خدمات ارائه شده در فروشگاه که طیف گسترده
                  ای از محصولات مجازی تا فیزیکی را شامل می گردد.
                </li>
                <li>قوانین محصولات و خدمات ارائه شده در فروشگاه:</li>
              </ul>

              <p>
                سی‌دی‌کی: محصولاتی که به صورت کد قابل خرید و فروش هستند (مانند کد شارژ
                حساب بازی وارکرافت و یا اعتبار ایرانسل) و تحویل این محصولات از طریق سیستم
                داخلی فروشگاه و یا ارسال با ایمیل انجام می‌شود و پس از ارسال آن ها فروشگاه
                هیچ مسئولیی در قبال کدها خریداری شده ندارد و به هیچ عنوان قابل تعویض یا پس
                گرفتن نمی باشند.
              </p>
              <p>
                کالای فیزیکی: هر نوع محصولی که ماهیت فیزیکی داشته و ارسال آن از طریق شرکت
                های پستی (مانند شرکت پست جمهوری اسلامی ایران) انجام می شود.
              </p>
              <p>
                خرید و فروش گلد وارکرافت: دریافت و تحویل این محصول داخل بازی وارکرافت
                انجام می گیرد.
              </p>
              <p>
                شارژ حساب کاربری: این خدمت با دسترسی به حساب کاربری مشتری در وبسایت های
                خارجی و با شارژ دلاری این حساب های کاربری انجام می گیرد.
              </p>

              <h3>مدت زمان ارسال یا انجام سفارش:</h3>
              <p class="white">
                مدت زمان تحویل هر محصول در صفحه توضیحات آن محصول قابل رویت می باشد و به
                طور کلی محصولات سی دی کی به صورت “تحویل آنی” هستند یعنی بلافاصله پس از
                پرداخت، از طریق حساب کاربری مشتری در فروشگاه و از طریق ایمیل ارسالی توسط
                فروشگاه قابل دریافت هستند.
              </p>
              <p class="white">
                برای محصولات فیزیکی، حداکثر تا دو روز کاری سفارش جهت ارسال به مشتری تحویل
                شرکت پستی می گردد.
              </p>

              <h3>قوانین عمومی:</h3>
              <p class="white">
                مشتری موظف به ارائه و ثبت اطلاعات و مدارک شناسایی خود در فروشگاه می باشد و
                هر گونه خسارت ناشی از نقص و یا ثبت اطلاعات نادرست بر عهده مشتری می باشد.
              </p>
              <p class="white">
                فروشگاه حق دارد ارائه خدمات به هریک از مشتریان خود را بدون اطلاع قبلی قطع
                نموده و یا سطح دسترسی مشتری به اکانت خود را محدود نماید
              </p>
              <p class="white">
                بدون اطلاع آنها و هر نوع کلاه برداری دیگر، فروشگاه حق خود می داند حساب
                کاربر را محدود نموده و موارد را در مراجع ذیصلاح پیگیری نماید.
              </p>
              <p class="white">
                فروشگاه متعهد به رعایت “قوانین مصوب تجارت الکترونیک جمهوری اسلامی ایران” و
                قوانین “حفظ حریم خصوصی” می باشد. لذا این قوانین نیز شامل حال مشتریان خواهد
                بود.
              </p>
              <p class="white">
                در صورت موجودی کالا در فروشگاه برای سفارش، قیمت مشاهده شده و پرداختی توسط
                شما، قیمت قطعی بوده و هیچ گونه مبلغی مبنی بر هزینه های اضافی یا پنهان از
                مشتری دریافت نمی گردد.
              </p>

              <h3>شرایط مشتری:</h3>
              <p class="white">
                مشتری بایستی ۱۸ سال تمام (سن قانونی) داشته باشد. پذیرفته شدن این سند از
                جانب افراد کمتر از ۱۸ سال باطل قلمداد خواهد شد و هر گونه مشکلات یا خسارات
                احتمالی این گروه از مشتریان به صورت مستقیم متوجه آن ها خواهد بود و فروشگاه
                در این باره هیچ مسئولیتی را نمی پذیرد. این گروه از مشتریان می بایست از
                طریق ولی یا کفیل خود اقدام به انجام سفارش نمایند.
              </p>
            </div>
          </section>
        </div>
      </div>
    </div>
  </section>
  <application></application>
  <my-footer></my-footer>
</template>
<script>
import MyFooter from "../components/Footer/MyFooter.vue";
import MyHeader from "../components/Header/MyHeader.vue";
import application from "../components/Home/application.vue";
import Toolbar from "../components/Toolbar/toolbar.vue";
export default {
  name: "Terms",
  components: { application, MyFooter, Toolbar, MyHeader },
  
};
</script>
