<template>
  <section class="comment inview">
    <div class="comment__wrapper">
      <div class="row">
        <single-comment
          v-for="(item, i) in items"
          :key="i"
          :name="item.name"
          :number="item.number"
          :text="item.text"
          :url="item.url"
          
        ></single-comment>
      </div>
    </div>
  </section>
</template>

<script>
import singleComment from "./single-comment.vue";
export default {
  components: { singleComment },
  name: "comment",
  data() {
    return {
      items: [
        {
          number: 1,
          name: "عنوان شماره یک",
          url: "#",
          text:
            "از تجربه ی 2 ساله ی خود در زمینه ی آموزش آنلاین استفاده کردم و این دوره را به صورت حرفه ای سازماندهی کرده ام. زمانی که داشتم این کار را میکردم به فکر توسعه دهندگان مبتدی و متوسط بودم، بنابراین تمامی اطلاعاتی که به",
        },
        {
          number: 2,
          name: "عنوان شماره دو",
          url: "#",
          text:
            "از تجربه ی 2 ساله ی خود در زمینه ی آموزش آنلاین استفاده کردم و این دوره را به صورت حرفه ای سازماندهی کرده ام. زمانی که داشتم این کار را میکردم به فکر توسعه دهندگان مبتدی و متوسط بودم، بنابراین تمامی اطلاعاتی که به",
        },
        {
          number: 3,
          name: "عنوان شماره سه",
          url: "#",
          text:
            "از تجربه ی 2 ساله ی خود در زمینه ی آموزش آنلاین استفاده کردم و این دوره را به صورت حرفه ای سازماندهی کرده ام. زمانی که داشتم این کار را میکردم به فکر توسعه دهندگان مبتدی و متوسط بودم، بنابراین تمامی اطلاعاتی که به",
        },
        {
          number: 4,
          name: "عنوان شماره چهار",
          url: "#",
          text:
            "از تجربه ی 2 ساله ی خود در زمینه ی آموزش آنلاین استفاده کردم و این دوره را به صورت حرفه ای سازماندهی کرده ام. زمانی که داشتم این کار را میکردم به فکر توسعه دهندگان مبتدی و متوسط بودم، بنابراین تمامی اطلاعاتی که به",
        },
      ],
    };
  },
};
</script>
